{
  "users": [
    {
      "email": "thanhhuynh4698@gmail.com",
      "password": "thanh123",
      "confirmPassword": "thanh123",
      "name": "Thành",
      "fullName": "Huỳnh Minh Thành",
      "phone": "0779416139",
      "country": "Danang",
      "address": "122 Phan Thanh",
      "gender": "male",
      "avatar": "https://firebasestorage.googleapis.com/v0/b/fashion-shop-758e3.appspot.com/o/files%2FImage%20from%20iOS.jpg?alt=media&token=5b81984e-350d-4439-b413-586c00d0589a",
      "id": 1
    }
  ],
  "products": [
    {
      "id": "3789030c-8ad6-447c-a929-90f11dd49377",
      "name": "ÁO THUN TAY NGẮN NAM IN HỌA TIẾT FORM FITTED",
      "inStock": 11,
      "price": 25,
      "category_id": "6fd4f5d1-eaf5-4266-aa52-98b2861139b0",
      "size": "M",
      "created_at": "2/11/2023, 12:19:14 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22tss014_golden_yellow_1_1_.jpg",
      "description": "Áo Thun Tay Ngắn Nam In Họa Tiết Form Fitted - 10F22TSS014 với thiết kế tay ngắn, cổ tròn kết hợp có phía trước ngực, form ôm vừa vặn vào body và chất liệu 100% cotton thoáng mát và thấm hút mồ hôi tốt. Điểm đặc biệt sản phẩm là phần họa tiết chữ trước ngực được in rất tỉ mỉ và sắc giúp chiếc áo trở nên ấn tượng, trẻ trung và hiện đại hơn.",
      "status": true,
      "qty": 1
    },
    {
      "id": "3e27574a-4528-47d8-8e31-f175865e7242",
      "name": "ÁO THUN NAM TAY NGẮN TRƠN FORM FITTED",
      "inStock": 12,
      "price": 25,
      "category_id": "6fd4f5d1-eaf5-4266-aa52-98b2861139b0",
      "size": "S",
      "created_at": "2/11/2023, 12:21:44 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10s21tsh019cr2_-_pumice_stone_31_.jpg",
      "description": "Áo thun tay ngắn là một trong những item cơ bản phổ biến trong thời trang thường ngày. Với tổng thể đơn giản, thoải mái và tính ứng dụng cao, áo thun luôn là lựa chọn ưu tiên nhiều người. Áo thun tay ngắn. FITTED - 10S21TSH019CR2 là item basic chinh phục người mặc bởi chất vải mềm mại, thoáng mát rất phù hợp với mùa hè.",
      "status": true,
      "qty": 1
    },
    {
      "id": "3484d7ef-f384-4a20-991f-e93d42c8c386",
      "name": "ÁO POLO NAM TAY NGẮN KẺ SỌC FORM LOOSE ",
      "inStock": 15,
      "price": 29,
      "category_id": "6fd4f5d1-eaf5-4266-aa52-98b2861139b0",
      "size": "M",
      "created_at": "2/11/2023, 12:23:50 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22pol019_peyote_1__1.jpg",
      "description": "Áo Polo Nam Tay Ngắn Kẻ Sọc Form Loose - 10F22POL019 được thiết kế với phong cách sang trọng và thanh lịch. Áo được làm từ chất liệu cotton kết hợp với họa tiết kẻ sọc ngang ở phần thân giúp chiếc áo có điểm nhấn hơn. Phần cổ áo được dệt gân to, làm đứng form cổ trông bạn nam toát lên vẻ đẹp sang trọng, lịch sự. Thiết kế này vừa đem lại vẻ chỉn chu, tao nhã cho bạn nam vừa đem đến sự thoáng mát, dễ chịu cho người mặc.\n\n",
      "status": true,
      "qty": 1
    },
    {
      "id": "cb3029de-83d2-493b-a75c-534e1f9d2e0c",
      "name": "ÁO POLO NAM TAY NGẮN PHỐI TAPE KẺ SỌC FORM FITTED",
      "inStock": 9,
      "price": 29,
      "category_id": "6fd4f5d1-eaf5-4266-aa52-98b2861139b0",
      "size": "M",
      "created_at": "2/11/2023, 12:25:33 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22pol009_navy_peony_1__1.jpg",
      "description": "Áo Polo Nam Tay Ngắn Phối Tape Kẻ Sọc Form Fitted - 10F22POL009 được thiết kế với phong cách sang trọng và thanh lịch. Áo được làm từ chất liệu cotton kết hợp với họa tiết kẻ sọc ngang ở phần thân giúp chiếc áo có điểm nhấn hơn. Phần cổ áo được dệt gân to, làm đứng form cổ trông bạn nam toát lên vẻ đẹp sang trọng, lịch sự. Thiết kế này vừa đem lại vẻ chỉn chu, tao nhã cho bạn nam vừa đem đến sự thoáng mát, dễ chịu cho người mặc.",
      "status": true,
      "qty": 1
    },
    {
      "id": "5f139a63-6e3c-48a8-8267-5094b8a8309c",
      "name": "ÁO THUN TAY NGẮN NAM THÊU HÌNH FORM FITTED",
      "inStock": 8,
      "price": 29,
      "category_id": "6fd4f5d1-eaf5-4266-aa52-98b2861139b0",
      "size": "S",
      "created_at": "2/11/2023, 12:27:24 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22tss004_black_3_1_1.jpg",
      "description": "Áo Thun Tay Ngắn Nam Thêu Hình Form Fitted - 10F22TSS004 với thiết kế tay ngắn, cổ tròn kết hợp có phía trước ngực, form ôm vừa vặn vào body và chất liệu 100% cotton thoáng mát và thấm hút mồ hôi tốt. Điểm đặc biệt sản phẩm là phần họa tiết thêu đặc trưng Routine mang những nét văn hóa rất Việt Nam.",
      "status": true,
      "qty": 1
    },
    {
      "id": "d92cf5da-5c5b-4e5f-a30c-044b8c9cbf60",
      "name": "ÁO POLO NAM TAY NGẮN PHỐI MÀU CỔ FORM FITTED",
      "inStock": 12,
      "price": 35,
      "category_id": "6fd4f5d1-eaf5-4266-aa52-98b2861139b0",
      "size": "M",
      "created_at": "2/11/2023, 12:29:01 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/e/c/ecom.21.10_197__1.jpg",
      "description": "Áo Polo Nam Tay Ngắn Phối Cổ Form Fitted - 10F22POL023R1 là item thể hiện được sự thanh lịch của các chàng trong mọi tình huống nhưng cũng không kém phần năng động. Được may từ chất liệu 100% cotton thoáng mát, thấm hút mồ hôi mà còn có thểm khả năng co giãn cực tốt, độ bền cao. Form áo fitted vừa vặn với cơ thể giúp các chàng tôn lên vóc dáng khỏe khoắn. Điểm đặc biệt nhất giúp chiếc áo trở nên nổi bật chính là thiết kế phối màu ở phần cổ áo và tay áo, mang đến cảm giác mới lạ, trẻ trung thể hiện phong cách cá tính, năng động.",
      "status": true,
      "qty": 1
    },
    {
      "id": "91f831c3-fb60-4b6c-b2da-8f142718c924",
      "name": "ÁO THUN NAM TAY NGẮN TRƠN FORM REGULAR",
      "inStock": 12,
      "price": 33,
      "category_id": "6fd4f5d1-eaf5-4266-aa52-98b2861139b0",
      "size": "S",
      "created_at": "2/11/2023, 12:29:51 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22tss009_2__1.jpg",
      "description": "Áo Thun Nam Tay Ngắn Trơn Form Regular - 10F22TSS009 được may từ chất liệu cotton thoáng mát, mịn tay và có khả năng thấm hút mồ hôi cực tốt. Áo được thiết kế theo form áo cổ điểm, vừa vặn với cơ thể người mặc, phần cổ áo có thiết kế cài nút không chỉ giúp các chàng có thể dễ dàng thay đổi độ rộng của cổ áo mà còn mang lại phong cách thanh lịch, trẻ trung. Với form áo này có thể đem đến sự thoải mái, dễ chịu cho người mặc. Là một item dễ mặc, dễ phối kèm theo sự đa dạng về màu sắc, chắc hẳn đây sẽ là 'chân ái' của nam giới.",
      "status": true,
      "qty": 1
    },
    {
      "id": "e8e014fb-a77e-41df-8868-b2515b6f329e",
      "name": "ÁO THUN NAM TAY NGẮN IN HỌA TIẾT FORM REGULAR",
      "inStock": 12,
      "price": 29,
      "category_id": "6fd4f5d1-eaf5-4266-aa52-98b2861139b0",
      "size": "M",
      "created_at": "2/11/2023, 12:31:37 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/e/c/ecom.21.10_711__1.jpg",
      "description": "Áo Thun Nam Tay Ngắn In Họa Tiết Form Regular - 10F22TSS015 mang form áo cổ điể của áo thun, dáng suông thẳng đứng từ trên xuống nên có độ rộng cho người mặc thoải mái cử động. Được làm từ chất liệu hiện đại, là chất bán tổng hợp mang đặc tính mền mịn, nhẹ và có khả năng giữ form tốt. Điểm nhấn ấn tượng nhất của chiếc áo chính là những họa tiết hình vẽ mới lạ và thú vị được in ở phần thân trước của áo mang đến sự trẻ trung và cá tính cho chiếc áo.",
      "status": true,
      "qty": 1
    },
    {
      "id": "6c3eb6e3-dcee-4390-a7cc-0117d5037074",
      "name": "ÁO THUN TAY NGẮN NAM IN HÌNH QUÝ MÃO FORM LOOSE ",
      "inStock": 15,
      "price": 29,
      "category_id": "6fd4f5d1-eaf5-4266-aa52-98b2861139b0",
      "size": "M",
      "created_at": "2/11/2023, 12:33:20 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/e/c/ecom.18.11_88_1_1.jpg",
      "description": "Áo Thun Tay Ngắn Nam Cotton In Họa Tiết Form Loose - 10F22TSS016 được sử dụng chất liệu từ tự nhiên không chỉ an toàn cho da người dùng mà còn mang đặc tính mềm mịn, thoáng mát. Form áo được thiết rộng rãi, thường rộng ở phần bả vai, eo nhưng trông không luộm thuộm. Áo được thiết kế thêm điểm nhấn đặc biệt chính là những họa tiết hình vẽ ngộ ngĩnh về mèo. Những họa tiết này không chỉ giúp chiếc áo không đơn điệu, nhàm chán mà còn mang đến sự trẻ trung cho người mặc. Đây là một item có khả năng linh hoạt trong mọi tình huống từ đi làm đến đi chơi, ngoài ra còn có khả năng biến tấu theo nhiều phong cách khác nhau.",
      "status": true,
      "qty": 1
    },
    {
      "id": "a5ddc01b-9834-44d5-acde-cdd187978021",
      "name": "ÁO THUN NAM TAY NGẮN HÌNH TẾT QUÝ MÃO FORM REGULAR",
      "inStock": 8,
      "price": 33,
      "category_id": "6fd4f5d1-eaf5-4266-aa52-98b2861139b0",
      "size": "S",
      "created_at": "2/11/2023, 12:34:51 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/e/c/ecom.21.10_655_.jpg",
      "description": "Áo Thun Nam Tay Ngắn In Họa Tiết Form Regular - 10F22TSS017 mang form dáng cổ điển của áo thun, dáng suông thẳng đứng, vừa vặn có độ rộng cho người mặc dễ dàng cử động và có thể phù hợp với mọi vóc dáng. Áo được may từ chất liệu cotton có nguồn gốc tự nhiên, mang những đặc tính nổi bật như thoáng mát, thấm hút mồ hôi cực tốt. Ngoài ra, trên phần thân trước của áo còn được in thêm những hình vẽ về mèo đầy sinh động mang lại cảm giác mới lạ cho chiếc áo.",
      "status": true,
      "qty": 1
    },
    {
      "id": "37ed3f94-2fd6-4aef-9574-0217825c0959",
      "name": "ÁO SƠ MI NAM TAY DÀI CO GIÃN TRƠN FORM REGULAR",
      "inStock": 8,
      "price": 35,
      "category_id": "2385351f-47c1-4257-af59-b741701bfa02",
      "size": "M",
      "created_at": "2/11/2023, 12:40:31 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/e/c/ecom.18.11_79_1_1.jpg",
      "description": "Áo Sơ Mi Nam Tay Dài Co Giãn Trơn Form Regular - 10S22SHL003 là item đa năng có thể diện mọi lúc mọi nơi, từ nơi công sở đến đi học, đi chơi. Với form regular ôm vừa vặn người giúp người mặc dễ dàng tôn lên vóc dáng mạnh mẽ, khỏe khoắn của người đàn ông. Phần tà áo phía sau được thiết kế dài hơn hình cung mang lại sự thanh lịch, trẻ trung cho chiếc áo. Bên cạnh đó, áo còn được làm từ chất vải tổng hợp mang nhiều ưu điểm như mềm mại và ít nhăn.",
      "status": true,
      "qty": 1,
      "updated_at": "2/11/2023, 12:52:03 PM"
    },
    {
      "id": "49f4e923-09ab-4f44-9e16-e70a291f1059",
      "name": "ÁO SƠ MI NAM TAY DÀI SATIN TRƠN FORM REGULAR",
      "inStock": 9,
      "price": 35,
      "category_id": "2385351f-47c1-4257-af59-b741701bfa02",
      "size": "M",
      "created_at": "2/11/2023, 12:41:52 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22shl011_black_2__1.jpg",
      "description": "Áo Sơ Mi Nam Tay Dài Satin Trơn Form Regular - 10F22SHL011 là một item được thiết kế theo phong cách thanh lịch, sang trọng và đa năng cho các chàng có thể sử dụng trong mọi hoàn cảnh như đi làm, đi chơi hay dự tiệc tùng đều được. Được may từ chất liệu vải tổng hợp hiện đại mang ưu điểm vượt bật về khả năng chống nhăn, mỏng nhẹ và thấm hút cao. Điểm đặc biệt nhất giúp chiếc áo trở nên sang trọng hơn hẳn chính là độ bóng của bề mặc vải, nó còn giúp người mặc thu hút được ánh nhìn của người khác",
      "status": true,
      "qty": 1
    },
    {
      "id": "6560f9af-9075-4b78-94d7-ded325ad2a5f",
      "name": "ÁO SƠ MI NAM TAY NGẮN TEXTURE TRƠN FORM REGULAR",
      "inStock": 12,
      "price": 35,
      "category_id": "2385351f-47c1-4257-af59-b741701bfa02",
      "size": "L",
      "created_at": "2/11/2023, 12:43:19 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22shs006_brown_2__1.jpg",
      "description": "Áo Sơ Mi Nam Tay Ngắn Texture Trơn Form Regular - 10F22SHS006 được may từ chất liệu cotton tự nhiên mềm mịn và có ưu điểm thoáng mát, thấm hút mồ hôi tốt. Bề mặt vải có độ nhám nhẹ mang phong cách hiện đại, sành điệu. Form áo được thiết kế có ly ngay đô áo giúp áo giữ được độ rộng thoải mái nhưng trông vẫn gọn gàng, thanh lịch. Phần vạt áo được may lay bản to và thiết kế xẻ tả ở hai bên hông áo giúp tăng sự trẻ trung, năng động cho người mặc.",
      "status": true,
      "qty": 1
    },
    {
      "id": "4d4eae4b-178d-4664-a2cd-f3853ff607bb",
      "name": "ÁO SƠ MI NAM TAY DÀI PHỐI SỌC FORM FITTED",
      "inStock": 5,
      "price": 35,
      "category_id": "2385351f-47c1-4257-af59-b741701bfa02",
      "size": "S",
      "created_at": "2/11/2023, 12:44:37 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22shl043_ombre_blue_4__1.jpg",
      "description": "Áo sơ mi tay dài sọc phối chỉ Fitted - 10F22SHL043 được thiết kế theo form áo Fitted có phần thân và tay áo hơi ôm nhưng không quá bó sát vào người mà vẫn đem đến sự thoải mái cho người mặc. Được thiết kế suông thẳng kết hợp với họa tiết sọc giúp áo toát lên vẻ đẹp thanh lịch, trẻ trung cho bạn nam công sở sắm chúng trong tủ đồ của mình. Ngoài ra, item này cũng không quá kén khi có thể phối được với nhiều item khác trong tủ đồ của bạn.",
      "status": true,
      "qty": 1
    },
    {
      "id": "28b7be45-c0cf-4b08-997f-19aedccd7bd4",
      "name": "ÁO SƠ MI NAM TAY DÀI KẺ CARO FORM LOOSE",
      "inStock": 8,
      "price": 35,
      "category_id": "2385351f-47c1-4257-af59-b741701bfa02",
      "size": "M",
      "created_at": "2/11/2023, 12:45:58 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22shl030_moonlight_2__1.jpg",
      "description": "Áo Sơ Mi Tay Dài Form Loose – 10F22SHL030 là dáng áo sơ mi có thân và tay áo suông, rộng nhiều tạo phong thái thoải mái, phóng khoáng cho bạn nam. Điểm thu hút nhất của chiếc áo sơ mi này đó chính hoạ tiết đường kẻ caro lớn được phối màu sắc hài hoà mang đến vẻ đẹp vừa trẻ trung lại bắt kịp xu hướng thời trang hiện nay. Áo sơ mi không chỉ có kiểu dáng trẻ trung, thời trang mà còn được dệt từ 100% sợi bông tự nhiên với tính năng lưu giữ mùi hương và thấm hút mồ hôi ưu việt giúp khách hàng vẫn cảm nhận được sự thơm mát sau ngày dài.",
      "status": true,
      "qty": 1
    },
    {
      "id": "fff4a4a3-69bb-4c55-ae2e-a4b6d015a7b7",
      "name": "ÁO SƠ MI NAM FLANNEL TAY DÀI SỌC DỌC FORM REGULAR",
      "inStock": 6,
      "price": 35,
      "category_id": "2385351f-47c1-4257-af59-b741701bfa02",
      "size": "L",
      "created_at": "2/11/2023, 12:46:55 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22shl028_brown_2__1.jpg",
      "description": "Áo Sơ Mi Flannel Sọc. Regular – 10F22SHL028 có hoạ tiết là những đường kẻ sọc dọc kết hợp với phần tag phía sau cổ áo làm điểm nhấn giúp mẫu thiết kế thu hút ánh nhìn hơn. Form regular với thân áo suông hỗ trợ các bạn nam thuận tiện khi hoạt động. Hơn nữa, chất liệu cotton của sản phẩm luôn được biết đến rộng rãi với những đặc trưng như: thoáng mát và đem lại xúc cảm mềm mại khi mặc.",
      "status": true,
      "qty": 1
    },
    {
      "id": "ebc6d571-178b-4927-aa4a-6bf09a4d839d",
      "name": "ÁO SƠ MI NAM TAY DÀI TRƠN FORM FITTED",
      "inStock": 5,
      "price": 35,
      "category_id": "2385351f-47c1-4257-af59-b741701bfa02",
      "size": "L",
      "created_at": "2/11/2023, 12:48:05 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22shl046_navy_2_.jpg",
      "description": "Áo Sơ Mi Nam Tay Dài. Fitted - 10F22SHL046 một chiếc áo đa năng cho các chàng có thể hiện mọi lúc mọi nơi, từ nơi công sở đến chốn hẹn hò. Với form fitted ôm vào người giúp các chàng dễ dàng tôn lên vóc dáng mạnh mẽ, khỏe khoắn của người đàn ông. Phần tà áo được thiết kế hình cung mang lại sự thanh lịch, trẻ trung cho chiếc áo. Bên cạnh đó, áo còn được làm từ chất vải thoáng mát, thấm hút mồ hôi tốt và có độ bóng nhẹ giúp chiếc áo trông sang trọng và lịch lãm.",
      "status": true,
      "qty": 1
    },
    {
      "id": "88b50188-d512-40b0-a929-87457ef5af22",
      "name": "ÁO SƠ MI NAM TAY DÀI TRƠN FORM FITTED",
      "inStock": 5,
      "price": 33,
      "category_id": "2385351f-47c1-4257-af59-b741701bfa02",
      "size": "M",
      "created_at": "2/11/2023, 12:49:21 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22shl045_white_2_1.jpg",
      "description": "Áo Sơ Mi Nam Tay Dài. Fitted - 10F22SHL045 là một bảo bối không thể thiếu của cánh mày râu, bởi sơ mi trắng luôn là một chiếc áo thần kỳ có thể phù hợp mọi hoàn cảnh và giúp các chàng dễ dàng chinh phục trái tim của các cô gái. Với thiết kế vô cùng đơn giản có form áo tay dài, hơi ôm vào người để tôn lên vóc dáng khỏe khoắn của chàng. Phần nẹp áo được thiết kế che khuy đầy tinh tế, đây là một điểm cộng lớn cho chiếc áo này. Bên cạnh sự thanh lịch mà nó mang lại, với tà áo hình cánh cung cũng giúp chiếc áo không kém phần trẻ trung và thời thượng.",
      "status": true,
      "qty": 1
    },
    {
      "id": "3227155d-daa1-4ec5-ac7c-dd8762bc0ae5",
      "name": "ÁO SƠ MI NAM TAY NGẮN KẺ SỌC FORM REGULAR",
      "inStock": 5,
      "price": 35,
      "category_id": "2385351f-47c1-4257-af59-b741701bfa02",
      "size": "M",
      "created_at": "2/11/2023, 12:50:17 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10s21shs016_-_black_beauty_12__1.jpg",
      "description": "Áo Sơ Mi Tay Ngắn, Kẻ Sọc. Regular Form - 10S21SHS016 là chiếc áo thể hiện rõ nhất sự thanh lịch mà kiểu áo sơ mi tay ngắn mang lại bởi thiết kế cổ vest vừa lịch sự, vừa hiện đại. Áo còn mang họa tiết kẻ sọc đầy trẻ trung và thời thượng của những xu hướng thời trang hiện nay. Áo không chỉ giúp người mặc thể hiện được phong cách thời trang của riêng mình mà còn mang lại sự thoải mái và dễ chịu cho người đọc. Bởi form áo được thiết kế vừa vặn với cơ thể, chi tiết ly ngay đô áo phía sau giúp chiếc áo rộng rãi nhưng vẫn vừa với body người mặc, kết hợp cũng chất liệu cotton mang lại sự thoáng mát và thấm hút mồ hôi tốt giúp người mặc dễ dàng vận động.",
      "status": true,
      "qty": 1
    },
    {
      "id": "81df6e3d-a8cd-40af-80c5-e1a827d2d3fb",
      "name": "ÁO SƠ MI NAM TAY NGẮN TRƠN FORM REGULAR",
      "inStock": 5,
      "price": 35,
      "category_id": "2385351f-47c1-4257-af59-b741701bfa02",
      "size": "S",
      "created_at": "2/11/2023, 12:51:24 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10s22shs007_-_covert_green_2__1.jpg",
      "description": "Áo sơ mi tay ngắn. REGULAR - 10S22SHS007 được phối màu trung tính đơn giản và khỏe khoắn sẽ giúp bạn tự tin hơn trong những buổi gặp gỡ cùng bạn bè, đi du lịch, hay cả những buổi đi hẹn hò. Chất liệu thoáng mát tạo cho người mặc cảm giác thoải mái trong những ngày thời tiết nóng bức. Phần thân, tay áo suông, không ôm rộng rãi mang lại cảm giác thoải mái cho mọi hoạt động.",
      "status": true,
      "qty": 1
    },
    {
      "id": "4d23966e-5d56-4464-9569-5c1c6a5ab7ba",
      "name": "ÁO KHOÁC NAM COTTON FORM REGULAR",
      "inStock": 8,
      "price": 55,
      "category_id": "0db7e5eb-a1a0-4bb8-8e37-404363829bb2",
      "size": "L",
      "created_at": "2/11/2023, 1:01:49 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/e/c/ecom.21.10_232__1.jpg",
      "description": "Áo Khoác Nam Cotton Form Regular - 10F22JAC006 là item đa năng, dễ mặc, dễ phối hợp cùng nhiều loại trang phục khác nhau từ án thun, áo cổ cao,... Form áo mang đặc tính rộng rãi, thoải mái, kết hợp cùng chất liệu thoáng mát, thấm hút mồ hôi tốt giúp người mặc luôn cảm thấy dễ chịu. Điểm đặc biệt nhất của chiếc áo khoác này chính là phần họa tiết thuê chữ ở phần thân sau của áo, chúng giúp chiếc áo thêm phần cá tính, thời thượng.",
      "status": true,
      "qty": 1
    },
    {
      "id": "7eea9d60-94ec-4ce0-8a7b-b6a7d0b02660",
      "name": "ÁO KHOÁC NAM CỔ TRỤ PHỐI RIB ",
      "inStock": 5,
      "price": 55,
      "category_id": "0db7e5eb-a1a0-4bb8-8e37-404363829bb2",
      "size": "L",
      "created_at": "2/11/2023, 1:02:48 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22jac003_black_1__1.jpg",
      "description": "Áo Khoác Nam Cổ Trụ Phối Rib - 10F22JAC003 là một item vô cùng đa năng không chỉ có khả năng che chấn cơ thể tốt mà còn mang đến một phong cách thời trang vô cùng cá tính, trẻ trung cho người mặc. Thiết kế form dáng dài ngang mông, rộng rãi cho người mặc thoải mái hoạt động. Được làm từ chất liệu nhẹ, thoáng mát mang lại cảm giác dễ chịu cho người mặc",
      "status": true,
      "qty": 1
    },
    {
      "id": "dddd29c8-24be-42d2-9f3f-6401527da3e0",
      "name": "ÁO KHOÁC NAM TAY DÀI CÓ TÚI FORM REGULAR",
      "inStock": 5,
      "price": 65,
      "category_id": "0db7e5eb-a1a0-4bb8-8e37-404363829bb2",
      "size": "L",
      "created_at": "2/11/2023, 1:03:45 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22pca009_black_1.jpg",
      "description": "Áo Khoác Nam Tay Dài Có Túi Form Regular - 10F22JAC010 sử dụng chất liệu từ sợi bông tự nhiên, mang tính mền mịn, thoáng mát và thấm hút mồ hôi tốt giúp người mặc cảm thấy thoải mái, dễ chịu. Mang thiết kế cổ gập, dây khóa kéo đầy tinh tế, giúp chiếc áo trông gọn gàng, mang phong cách năng động. Thêm vào đó, phần thân trước của áo được may thêm túi hộp vừa tiện dụng, vừa tạo nên điểm nhấn cho chiếc áo. Đây là item dễ mặc dễ phối với nhiều loại trang phục, phù hợp với nhiều phong cách.",
      "status": true,
      "qty": 1
    },
    {
      "id": "626d34cd-9d94-4789-b28e-11e584909582",
      "name": "ÁO KHOÁC BOMBER NAM KẺ SỌC FORM REGULAR",
      "inStock": 8,
      "price": 75,
      "category_id": "0db7e5eb-a1a0-4bb8-8e37-404363829bb2",
      "size": "L",
      "created_at": "2/11/2023, 1:04:42 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22jac013-chipmunk--_2__optimized_1.jpg",
      "description": "Áo Khoác Bomber Nam Kẻ Sọc Form Regular - 10F22JAC013 được thiết kế form áo có đầu vai và tay áo suông, rộng, ở phần lay áo và cổ tay được thiết kế bo ôm vào cơ thể những vẫn có độ co giãn vừa thoải mái vừa gọn gàng. Áo được may từ sợi nhân tạo có khả năng chống nhăn tốt, bền, chống khuẩn và chống nước tốt. Với công nghệ dệt hiện đại tạo nên bề mặt vải có họa tiết sọc gân độc đáo, mới lạ thêm vài chi tiết nhãn dáng được thêu ở thân sau của áo. Chiếc áo khoác mang phong cách trẻ trung, cá tính cho người mặc. Đây là một item dễ mặc, dễ phối cùng nhiều loại trang phục khác nhau như áo thun, sơ mi hay len,...",
      "status": true,
      "qty": 1
    },
    {
      "id": "1e0c60f2-c91f-42c7-9191-9773eb8ea40f",
      "name": "ÁO KHOÁC NAM OVERCOAT DÁNG DÀI IN FORM",
      "inStock": 5,
      "price": 74,
      "category_id": "0db7e5eb-a1a0-4bb8-8e37-404363829bb2",
      "size": "L",
      "created_at": "2/11/2023, 1:06:03 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22jac026_black_4__1.jpg",
      "description": "Áo Overcoat in Overcoat - 10F22JAC026 được làm từ chất liệu polyester với khả năng mặt vải bền, giữ form ổn định và đặc biệt là chống nhăn tuy nhiên lại không thấm mồ hôi tốt. Áo được thiết kế form oversize rộng rãi, thoải mái cho người mặc. Ngoài ra, áo với dáng dài xuống đùi và rộng, suông thẳng và không ôm vào body nên sẽ phù hợp với những bạn có dáng người cao. Đặc biệt, áo là item không thể thiếu vào mùa đông lạnh giá với chức năng giữ nhiệt, giữ ấm cực kỳ tốt.",
      "status": true,
      "qty": 1
    },
    {
      "id": "58b78f20-063b-40d9-9925-1e8ef79488ab",
      "name": "ÁO KHOÁC JEAN NAM XẾP LY TRƠN FORM REGULAR",
      "inStock": 8,
      "price": 65,
      "category_id": "0db7e5eb-a1a0-4bb8-8e37-404363829bb2",
      "size": "L",
      "created_at": "2/11/2023, 1:07:12 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22dja004_d_navy_3__1.jpg",
      "description": "Áo Khoác Jean Xếp Ly Regular - 10F22DJA004 là item hot không thể thiếu trong tủ đồ của mọi chàng trai. Ngoài công dụng mặc đẹp ra thì áo khoác jean còn là item giữ ấm cơ thể khá tốt trong mùa thu đông. Áo được làm với chất liệu Jean - Denim khiến chất vải dày dặn và bền tốt. Với thiết kế form regular phần thân áo suông, rông, chiều dài ngang mông khiến áo ôm vừa vặn vào phần cơ thể mà không gây khó chịu. Đặc biệt, áo với thiết kế đa dạng màu sắc khiến bạn nam dễ dàng mix đồ mà không lo bị lỗi mốt.",
      "status": true,
      "qty": 1
    },
    {
      "id": "a0612fed-f77e-4319-bb98-37eeac6a8cc2",
      "name": "ÁO KHOÁC NAM CHẦN BÔNG KHÔNG TAY FORM REGULAR",
      "inStock": 8,
      "price": 65,
      "category_id": "0db7e5eb-a1a0-4bb8-8e37-404363829bb2",
      "size": "L",
      "created_at": "2/11/2023, 1:08:16 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22jac025_antarctica_2__1.jpg",
      "description": "Áo khoác chần bông không tay nhãn trang trí Regular - 10F22JAC025 có thể mặc với bất kỳ trang phục nào giúp bạn cảm thấy ấm áp lại cực kỳ thời trang. Chúng được thiết kế đầy sáng tạo và thanh lịch để phù hợp dành cho những bạn trẻ yêu thích style phá cách, nổi bật và đầy cá tính. Áo được làm từ chất liệu polyester với khả năng chống nhăn tốt, mặt vải bền giữ form cố định tốt. Với thiết kế không tay nhưng vẫn giữ ấm. Đây cũng là một cách để bạn có thể phối với item áo dài tay ở trong để tạo điểm style nổi bật, độc đáo.",
      "status": true,
      "qty": 1
    },
    {
      "id": "f5f8ed44-5294-4222-9a73-e4b8776b3a32",
      "name": "ÁO KHOÁC CHẦN BÔNG NAM PHỐI MÀU FORM REGULAR",
      "inStock": 9,
      "price": 65,
      "category_id": "0db7e5eb-a1a0-4bb8-8e37-404363829bb2",
      "size": "L",
      "created_at": "2/11/2023, 1:09:19 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22jac022_real_black_1__1_1.jpg",
      "description": "Áo Khoác Chần Bông Phối Màu. Regular – 10F22JAC022 có dáng áo regular giúp người mặc dễ phối đồ và đồng thời cũng làm cho vóc dáng của bạn nam trở nên cao lớn và nam tính hơn. Với cách phối màu khác kết hợp với đường viền ở tay và cổ áo đã làm thiết kế trở nên nổi bật và trẻ trung hơn. Chi tiết túi được may bên trong áo đã thể hiện được sự tinh tế của thiết kế khi vừa giữ được tính thẩm mỹ cho trang phục lại vừa đảm bảo bạn nam vẫn cảm thấy tiện nghi khi có thể dễ dàng cất vật dụng linh tinh của bản thân khi không dùng đến.",
      "status": true,
      "qty": 1
    },
    {
      "id": "83490006-c1d6-4e0f-9a1c-3d906b23be99",
      "name": "ÁO KHOÁC GIÓ NAM CHUI ĐẦU HỌA TIẾT FORM REGULAR",
      "inStock": 5,
      "price": 55,
      "category_id": "0db7e5eb-a1a0-4bb8-8e37-404363829bb2",
      "size": "L",
      "created_at": "2/11/2023, 1:10:48 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22jac019_rubber_3_.jpg",
      "description": "Áo Khoác Gió Chui Đầu Regular - 10F22JAC019 có kết cấu tinh tế, mỏng nhẹ và thoải mái, phiên bản áo có mũ trùm đầu, thêm dây rút, chống gió hiệu quả; dây kéo dài tới tận cổ, suôn mịn và không bị cản trở, dễ mặc vào và cởi ra, thiết kế màu sắc tương phản, phong phú, đầy tính thể thao, cổ tay áo và áo gấu co giãn. Áo được thiết kế với form regular dài ngang mông, vừa vặn với dáng người giúp diện lên thoải mái, dễ chịu.",
      "status": true,
      "qty": 1
    },
    {
      "id": "eef6528f-b9b7-4e85-a195-e63afd43527d",
      "name": "ÁO KHOÁC NAM SỌC CARO FORM REGULAR",
      "inStock": 8,
      "price": 55,
      "category_id": "0db7e5eb-a1a0-4bb8-8e37-404363829bb2",
      "size": "L",
      "created_at": "2/11/2023, 1:12:58 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22jac015_real_black_2__1.jpg",
      "description": "Áo Khoác Nam Sọc Caro Nhãn Trang Trí Form Regular - 10F22JAC015 được may từ chất liệu có khả năng chống nhăn, bền đẹp và chống nước rất tốt. Áo hơi rộng, suông thẳng và có chiều dài ngang mông. Được thiết kế theo kiểu dáng của một chiếc áo sơ mi kết hợp cũng khóa khéo tinh tế mang một phong cách vừa thanh lịch, vừa hiện đại và gọn nhẹ. Đặc biệt, áo còn mang họa tiết kẻ sọc mang lại vẻ đẹp trẻ trung, năng động cho người mặc.",
      "status": true,
      "qty": 1,
      "updated_at": "2/11/2023, 1:26:52 PM"
    },
    {
      "id": "de012d5b-21c1-4ec5-aac7-834baf845350",
      "name": "QUẦN JOGGER NYLON PHỐI CHỈ FORM JOGGER",
      "inStock": 15,
      "price": 45,
      "category_id": "986fad07-ab80-4d84-a027-cb0d9713f954",
      "size": "M",
      "created_at": "2/11/2023, 1:14:32 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22pjo005_black_3_1_1.jpg",
      "description": "Quần Jogger Nylon Phối Chỉ Form Jogger - 10F22PJO005 được may từ chất liệu có khả năng chống nước, cản gió và giữ ấm cơ thể tốt. Có form dáng jogger đầy cá tính, hiện đại, thêm vào đó ở phần cuối của ống quần còn có thêm chun túm vừa tạo được cảm giác gọn gàng và tạo sự thuận tiện và thoải mái khi mặc. Điểm nổi bật nhất của chiếc quần chính là chi tiết đường viền được phối chỉ đầy mới lạ, mang một vẻ đẹp phá cách.",
      "status": true,
      "qty": 1
    },
    {
      "id": "78b94acb-5478-4846-806b-a7e71e614807",
      "name": "QUẦN JOGGER KAKI FORM JOGGER",
      "inStock": 8,
      "price": 45,
      "category_id": "986fad07-ab80-4d84-a027-cb0d9713f954",
      "size": "M",
      "created_at": "2/11/2023, 1:15:36 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22pjo004_sea_turtle_1_1_1.jpg",
      "description": "Quần Jogger Kaki Form Jogger - 10F22PJO004 được may từ chất liệu tự nhiên mang những ưu điểm như thoáng mát, thấm hút mô hồi và chống mùi tốt. Form quần jogger mang phong cách năng động, cá tính với phần cuối của ống được may thêm thun, chun túm tạo gọn gàng và thuận tiện khi vận động. Quần được thiết kế nhiều túi mang đến sự tiện dụng cho người mặc, ngoài ra phần ống còn được may ghép mảnh đầy phá cách.",
      "status": true,
      "qty": 1
    },
    {
      "id": "a0714edf-7e32-45d1-9e17-0f84d8654e56",
      "name": "QUẦN JEAN NAM TRƠN FORM SLIM CROP",
      "inStock": 8,
      "price": 44,
      "category_id": "986fad07-ab80-4d84-a027-cb0d9713f954",
      "size": "L",
      "created_at": "2/11/2023, 1:16:37 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22dpa038_l_indigo_3_1_1.jpg",
      "description": "Quần Jean Nam Trơn Form Slim Crop - 10F22DPA038 may từ chất liệu jean được dệt theo công nghệ dệt đôi hiện đại tạo nên tông màu mới lạ, bắt mắt. Kiểu quần vừa vặn với cơ thể nhưng không quá bó vào cơ thể, phần ống quần có chiều dài trên mắt cá chân rất dễ phối cùng nhiều lại giày khác nhau. Đây là một item dễ mặc, dễ phối đồ và vô cùng đa năng có thể sử dụng trong mọi hoàn cảnh từ đi làm đến đi chơi đều được.",
      "status": true,
      "qty": 1
    },
    {
      "id": "0fc8bf20-8511-453d-8b8d-ebd1098003db",
      "name": "QUẦN JEAN NAM TRƠN FORM SLIM",
      "inStock": 5,
      "price": 45,
      "category_id": "986fad07-ab80-4d84-a027-cb0d9713f954",
      "size": "L",
      "created_at": "2/11/2023, 1:17:49 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22dpa004_brown_2___1.jpg",
      "description": "Quần Jean Nam Trơn Form Slim - 10F22DPA004 được may từ chất liệu dày dặn, có độ bên cao và giữ form tốt. Quần có thiết kế form ôm vừa chân nhưng vẫn có độ thoải mái khi cử động. Đây là một item đa năng có thể mặc trong nhiều hoàn cảnh khác nhau. Có tông màu quần jean cơ bản dễ mix cùng nhiều trang phục khác nhau cho ra đa dạng phong cách.",
      "status": true,
      "qty": 1
    },
    {
      "id": "c8185337-cd46-4fb8-88fb-861d2efdea03",
      "name": "QUẦN JEAN NAM ỐNG ÔM TRƠN FORM SLIM CROP",
      "inStock": 8,
      "price": 45,
      "category_id": "986fad07-ab80-4d84-a027-cb0d9713f954",
      "size": "L",
      "created_at": "2/11/2023, 1:18:49 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22dpa041_m_indigo_thumbnail__1.jpg",
      "description": "Quần Jean Nam Ống Ôm Trơn Form Slim Crop - 10F22DPA041 là một item hiện đại, dễ mặc, dễ phối với nhiều loại trang phục khác nhau và có thể sử dụng trong mọi hoàn cảnh. Chất liệu jean dày dặn, bền đẹp, với công nghệ dệt đôi hiện đại tạo ra gam màu mới lạ, độc đáo và trẻ trung. Kết hợp cũng form quần ôm dáng, phần ống dáng lửng vừa năng động vừa giúp tôn dáng người mặc.",
      "status": true,
      "qty": 1
    },
    {
      "id": "1ba9b1ca-6977-4ff1-92c4-50b48f67156c",
      "name": "QUẦN JEAN NAM ỐNG RỘNG TRƠN",
      "inStock": 8,
      "price": 45,
      "category_id": "986fad07-ab80-4d84-a027-cb0d9713f954",
      "size": "L",
      "created_at": "2/11/2023, 1:20:00 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/e/c/ecom.21.10_41__1.jpg",
      "description": "Quần Jean Nam Ống Rộng Trơn Form Straight Crop - 10F22DPA037 là một item dễ mặc, dễ phối và ít lỗi mốt, ngoài ra còn là một chiếc quần phù hợp mọi vóc dáng, mang lại sự thoải mái tối đa cho người mặc. Bởi form quần rộng rãi, ống suông thẳng từ trên xuống và ống quần là ống lửng có chiều dài ngắn trên mắt cá chân cho các chàng thoải mái mix&match cùng nhiều loại giày khác nhau như sneaker, giày cao cổ như boot,... Chiếc ống lửng cũng mang đến một phong cách trẻ trung, năng động. Kết hợp cùng chất liệu jean-denim dệt đôi mang đặc tính dày dặn, bền và giữ form cực tốt.",
      "status": true,
      "qty": 1,
      "updated_at": "2/11/2023, 1:27:41 PM"
    },
    {
      "id": "f1fe68d0-8ef2-4f60-9083-ec9a310dd5cb",
      "name": "QUẦN JEAN NAM TRƠN FORM STRAIGHT",
      "inStock": 12,
      "price": 48,
      "category_id": "986fad07-ab80-4d84-a027-cb0d9713f954",
      "size": "M",
      "created_at": "2/11/2023, 1:21:20 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/e/c/ecom.21.10_739__1.jpg",
      "description": "Quần Jean Nam Trơn Form Straight - 10F22DPA011 mang form quần classic, ống rộng suông từ trên xuống nhưng vẫn vừa vặn với cơ thể. Kết hợp cùng việc sử dụng chất liệu vải jean dệt đôi hiện đại 1 sợi trắng, 1 sợi màu tạo nên một bề mặt vải mới lạ, bắt mắt. Quần được thiết kế kiểu dáng và mang màu sắc điển hình của quần jean, là một item dễ mặc, dễ phối mọi loại trang phục.",
      "status": true,
      "qty": 1
    },
    {
      "id": "5b96e31d-d9d1-4cb4-a0cd-af371af66fff",
      "name": "QUẦN JOGGER NAM VISCOSE PHỐI TAPE",
      "inStock": 12,
      "price": 45,
      "category_id": "986fad07-ab80-4d84-a027-cb0d9713f954",
      "size": "L",
      "created_at": "2/11/2023, 1:22:48 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22pjo003_green_2__1.jpg",
      "description": "Quần Jogger Nam Viscose Phối Tape - 10F22PJO003 là sản phẩm đã quá quen thuộc với các chàng yêu thích thể thao hay có phong cách thời trang năng động, trẻ trung. Form jogger mang đến sự gọn gàng, thoải mái khi bạn nam hoạt động nhưng cũng góp phần tạo cảm giác đôi chân của người mặc trở nên dài và hút mắt hơn. Tone màu đa dạng nên khách hàng có thể tuỳ thuộc vào sở thích và phong cách cá nhân để lựa chọn mẫu thiết kế cho mình. Thiết kế sọc dọc tạo hiệu ứng chân dài và cá tính hơn cho người mặc.",
      "status": true,
      "qty": 1
    },
    {
      "id": "a891ac6c-312c-42c1-a125-e84eacbd9ee4",
      "name": "QUẦN VẢI NAM TÚI CHÉO FORM SLIM",
      "inStock": 5,
      "price": 40,
      "category_id": "986fad07-ab80-4d84-a027-cb0d9713f954",
      "size": "M",
      "created_at": "2/11/2023, 1:24:38 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22pfo005_aloy_1__1.jpg",
      "description": "QUẦN VẢI NAM TÚI CHÉO FORM SLIM - 10F22PCA005 là một chiếc quần đa năng không chỉ phù hợp với nhiều hoàn cảnh khác nhau mà còn có thể dễ dàng mix cũng nhiều trang phục khác nhau để cho ra đa dạng phong cách. Thiết kế form quần phổ biến, không quá ôm sát cũng không quá rộng. Kết hợp thêm chất liệu thoáng mát, thấm hút mồ hôi tốt cho người mặc cảm giác thoải mái, dễ chịu khi mặc.",
      "status": true,
      "qty": 1
    },
    {
      "id": "5971c09f-688f-4e65-9319-f9c3709c92a1",
      "name": "QUẦN DÀI KAKI NAM DOBBY FORM SLIM",
      "inStock": 8,
      "price": 45,
      "category_id": "986fad07-ab80-4d84-a027-cb0d9713f954",
      "size": "M",
      "created_at": "2/11/2023, 1:25:23 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22pca005_covert_green_3__1.jpg",
      "description": "Quần Dài Kaki Nam Dobby Form Slim - 10F22PCA005 là một chiếc quần đa năng không chỉ phù hợp với nhiều hoàn cảnh khác nhau mà còn có thể dễ dàng mix cũng nhiều trang phục khác nhau để cho ra đa dạng phong cách. Thiết kế form quần phổ biến, không quá ôm sát cũng không quá rộng. Kết hợp thêm chất liệu thoáng mát, thấm hút mồ hôi tốt cho người mặc cảm giác thoải mái, dễ chịu khi mặc.",
      "status": true,
      "qty": 1
    },
    {
      "id": "0e42a005-5f88-46b6-870f-6b6b9f36fd50",
      "name": "QUẦN SHORT NAM KAKI FORM STRAIGHT",
      "inStock": 8,
      "price": 35,
      "category_id": "e56e4e6c-bbd3-4c84-8662-069267ca62f8",
      "size": "M",
      "created_at": "2/11/2023, 1:33:38 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22psh006_navy_2_1_1.jpg",
      "description": "Quần Short Nam Kaki Form Straight - 10F22PSH006 mang form dáng rộng rãi, thoải mái có phần ống suông thẳng nhưng vẫn vừa vặn với cơ thể, không quá thùng thình. Được may từ chất liệu dày dặn, bền, có khả năng giữ form tốt và đa dạng về màu sắc. Là một item được thiết kế theo phong cách đơn giản có thể phù hợp với mọi dáng người, mọi phong cách và vô cùng dễ phối đồ.",
      "status": true,
      "qty": 1
    },
    {
      "id": "60dee8bf-fbcf-4b73-bf51-651a74d64d60",
      "name": "QUẦN SHORT KAKI NAM TÚI OVERSIZE",
      "inStock": 8,
      "price": 35,
      "category_id": "e56e4e6c-bbd3-4c84-8662-069267ca62f8",
      "size": "M",
      "created_at": "2/11/2023, 1:34:43 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22psh011_travertine_2__1.jpg",
      "description": "Quần Short Kaki Nam Túi Oversize Form Regular - 10F22PSH011 được làm từ chất liệu tự nhiên có ưu điểm thoáng mát, sờ mịn tay và có khả năng thấm hút mồ hôi tốt. Form quần ống rộng, suông thẳng từ trên xuống tạo cảm giác thoải mái khi vận động. Đặc biệt, phần túi to và được thiết kế may nổi độc đáo và đầy phá cách.",
      "status": true,
      "qty": 1
    },
    {
      "id": "2d729583-7052-4f8e-b149-2ad20d69e3b2",
      "name": "QUẦN SHORT NAM ỐNG RỘNG",
      "inStock": 8,
      "price": 40,
      "category_id": "e56e4e6c-bbd3-4c84-8662-069267ca62f8",
      "size": "L",
      "created_at": "2/11/2023, 1:35:52 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/r/o/rou3228_1_thumbnail__1.jpg",
      "description": "Quần Short Nam Ống Rộng Nhãn Trang Trí Form Relax - 10S22PSH016 được làm từ sợi bông tự nhiên, sờ mịn tay và mang ưu điểm vượt trội là thoáng mát, thấm hút mồ hôi tốt. Là chiếc quần thể thao ống rộng, kèm theo lưng quần có dây rút vô cùng tiện dụng. Ngoài ra, quần còn được thêm chi tiết nhãn dán ở phần ống tạo điểm nhấn cho chiếc quần và mang đến sự trẻ trung và năng động cho người mặc.",
      "status": true,
      "qty": 1
    },
    {
      "id": "edb0f96c-9313-47be-956e-c0ea29c332f5",
      "name": "QUẦN SHORT NỈ NAM ỐNG RỘNG",
      "inStock": 5,
      "price": 40,
      "category_id": "e56e4e6c-bbd3-4c84-8662-069267ca62f8",
      "size": "M",
      "created_at": "2/11/2023, 1:37:25 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22psh002_oxford_tan_2_1_1.jpg",
      "description": "QUẦN SHORT NỈ NAM ỐNG RỘNG - 10F22PSH008 là một item thoải mái, năng động và có khả năng mix&match cùng nhiều loại áo khác nhau. Với form dáng hiện đại có eo và mông ôm nhẹ vào người nhưng đùi thì suông rộng và có chiều dài trên đầu gối. Kết hợp thêm chất liệu thoáng mát, chống mùi tốt và bền mặt vải có độ nhám nhẹ mang đến mọt phong cách hiện đại, sang trọng.",
      "status": true,
      "qty": 1
    },
    {
      "id": "cba8af55-7016-4fb9-b12d-3b7a102b74f6",
      "name": "QUẦN SHORT KAKI NAM TEXTURE",
      "inStock": 11,
      "price": 40,
      "category_id": "e56e4e6c-bbd3-4c84-8662-069267ca62f8",
      "size": "L",
      "created_at": "2/11/2023, 1:38:05 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22psh008_deep_lichen_2__1.jpg",
      "description": "Quần Short Kaki Nam Texture Form Relax - 10F22PSH008 là một item thoải mái, năng động và có khả năng mix&match cùng nhiều loại áo khác nhau. Với form dáng hiện đại có eo và mông ôm nhẹ vào người nhưng đùi thì suông rộng và có chiều dài trên đầu gối. Kết hợp thêm chất liệu thoáng mát, chống mùi tốt và bền mặt vải có độ nhám nhẹ mang đến mọt phong cách hiện đại, sang trọng",
      "status": true,
      "qty": 1
    },
    {
      "id": "dc7a7e6e-5091-4b39-a5ab-11fd6f5a5083",
      "name": "QUẦN SHORT ĐŨI NAM LINEN TRƠN",
      "inStock": 5,
      "price": 38,
      "category_id": "e56e4e6c-bbd3-4c84-8662-069267ca62f8",
      "size": "S",
      "created_at": "2/11/2023, 1:39:13 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10s22psh007_covert_green_2__1.jpg",
      "description": "Quần Shorts. Relax – 10S22PSH007 chính là mẫu quần phù hợp nhất cho những ngày “không có gì để mặc” vì bất kì kiểu dáng áo nào khi được phối với chiếc quần này đều trở nên hợp lí và tôn lên được nét trẻ trung, năng động. Form quần relax vừa đảm bảo giúp chàng thoải mái hoạt động, vừa tạo hiệu ứng “hack” chân thon dài cho người mặc. Sản phẩm có 3 tone màu đều thuộc những tone màu trung tính nhằm đa dạng sự lựa chọn hơn cho khách hàng cũng như đảm bảo giữ nguyên khả năng dễ phối đồ của thiết kế. Chất liệu linen pha viscose giúp tăng độ bền của sản phẩm và đem lại cảm giác thoáng mát khi mặc.",
      "status": true,
      "qty": 1
    },
    {
      "id": "0d2fde78-9266-4e85-9235-af7b290a9c80",
      "name": "QUẦN SHORT JEAN NAM TRƠN",
      "inStock": 8,
      "price": 38,
      "category_id": "e56e4e6c-bbd3-4c84-8662-069267ca62f8",
      "size": "M",
      "created_at": "2/11/2023, 1:40:11 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/_/1/_10s22dps001-white-_1__1.jpg",
      "description": "Quần short jean. Loose - 10S22DPS001 với chất liệu Cotton thoải mái, thoáng mát và thấm hút mồ hôi tốt. Được thiết kế đơn giản mang phong cách đường phố, phóng khoáng. Form quần ống rộng, suông và thằng đứng từ trên xuống, đũng quần thấp tạo sự thoải mái, năng động khi mặc. Kết hợp cùng chi tiết túi hộp tăng thêm sự mạnh mẽ, nam tính và vô cùng tiệu lợi khi sử dụng.",
      "status": true,
      "qty": 1
    },
    {
      "id": "5156e419-6392-4152-ab10-d603a7aeebf3",
      "name": "QUẦN SHORT NAM GẬP LY FORM RELAX",
      "inStock": 11,
      "price": 38,
      "category_id": "e56e4e6c-bbd3-4c84-8662-069267ca62f8",
      "size": "M",
      "created_at": "2/11/2023, 1:41:03 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10s22psh014-black_-_6__1.jpg",
      "description": "Quần Shorts Gập Ly. Straight – 10S22PSH014 là mẫu quần shorts cơ bản nên có tối thiểu một chiếc trong tủ đồ của mỗi người. Với dáng quần straight cổ điển sẽ giúp che một số khuyết điểm ở phần mông đùi nhưng không gây ra tình trạng lùng thùng khi mặc. Do là mẫu quần shorts cơ bản nên thiết kế cũng mang màu sắc hơi trầm giúp bạn nam có thể phối với bất kỳ áo và phụ kiện đi kèm nào. Được làm từ loại vải tổng hợp giữa 3 chất liệu là polyester, rayon và spandex sẽ mang đến cho sản phẩm những tính năng vượt bậc như: độ bền và co giãn tốt cũng như khả năng giữ form ổn định.",
      "status": true,
      "qty": 1
    },
    {
      "id": "764c06fc-68eb-4e64-a5f5-b1b4db1a1f0f",
      "name": "QUẦN SHORT JEAN NAM TRƠN FORM LOOSE",
      "inStock": 4,
      "price": 45,
      "category_id": "e56e4e6c-bbd3-4c84-8662-069267ca62f8",
      "size": "S",
      "created_at": "2/11/2023, 1:43:04 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/_/1/_10s22dps001-white-_1__1.jpg",
      "description": "Quần short jean. Loose - 10S22DPS001 với chất liệu Cotton thoải mái, thoáng mát và thấm hút mồ hôi tốt. Được thiết kế đơn giản mang phong cách đường phố, phóng khoáng. Form quần ống rộng, suông và thằng đứng từ trên xuống, đũng quần thấp tạo sự thoải mái, năng động khi mặc. Kết hợp cùng chi tiết túi hộp tăng thêm sự mạnh mẽ, nam tính và vô cùng tiệu lợi khi sử dụng.",
      "status": true,
      "qty": 1
    },
    {
      "id": "fc8b9340-a4c1-4c4d-90f9-204006d5f80c",
      "name": "QUẦN SHORT NAM HỌA TIẾT FORM STRAIGHT",
      "inStock": 5,
      "price": 35,
      "category_id": "e56e4e6c-bbd3-4c84-8662-069267ca62f8",
      "size": "S",
      "created_at": "2/11/2023, 1:44:36 PM",
      "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10s21psh013_-_black_beauty_2_.jpg",
      "description": "Quần Short Nam Họa Tiết Cotton Form Straight - 10S21PSH013 luôn được các chàng trai ưu tiên lựa chọn nhờ tính ứng dụng rộng rãi, có thể diện đi chơi, đi dạo, tham gia thể thao, đi biển. Quần được làm từ chất liệu cotton với thiết kế ống suông thẳng đứng nhưng vẫn vừa vặn với cơ thể giúp người mặc tự tin, thoải mái hoạt động mà không bị khó chịu hay gò bó. Quần được thiết kế với điểm nổi bật nhờ họa tiết trên phần thân quần tạo cho người mặc điểm nhấn riêng với mọi người xung quanh.",
      "status": true,
      "qty": 1
    }
  ],
  "categories": [
    {
      "id": "6fd4f5d1-eaf5-4266-aa52-98b2861139b0",
      "name": "Áo thun",
      "created_at": "2/11/2023, 12:16:15 PM"
    },
    {
      "id": "2385351f-47c1-4257-af59-b741701bfa02",
      "name": "Áo sơ mi",
      "created_at": "2/11/2023, 12:16:34 PM"
    },
    {
      "id": "0db7e5eb-a1a0-4bb8-8e37-404363829bb2",
      "name": "Áo khoác",
      "created_at": "2/11/2023, 12:16:48 PM"
    },
    {
      "id": "986fad07-ab80-4d84-a027-cb0d9713f954",
      "name": "Quần dài",
      "created_at": "2/11/2023, 12:16:57 PM"
    },
    {
      "id": "e56e4e6c-bbd3-4c84-8662-069267ca62f8",
      "name": "Quần short",
      "created_at": "2/11/2023, 12:17:13 PM"
    }
  ],
  "cartOder": [],
  "roles": [
    {
      "id": "1",
      "type": "Admin"
    },
    {
      "id": "2",
      "type": "User"
    }
  ],
  "checkout": [
    {
      "listOrder": [
        {
          "userId": 1,
          "productId": "3789030c-8ad6-447c-a929-90f11dd49377",
          "quantity": 2,
          "id": 2,
          "product": {
            "id": "3789030c-8ad6-447c-a929-90f11dd49377",
            "name": "ÁO THUN TAY NGẮN NAM IN HỌA TIẾT FORM FITTED",
            "inStock": 11,
            "price": 25,
            "category_id": "6fd4f5d1-eaf5-4266-aa52-98b2861139b0",
            "size": "M",
            "created_at": "2/11/2023, 12:19:14 PM",
            "image": "https://routine.vn/media/catalog/product/cache/5de180fdba0e830d350bd2803a0413e8/1/0/10f22tss014_golden_yellow_1_1_.jpg",
            "description": "Áo Thun Tay Ngắn Nam In Họa Tiết Form Fitted - 10F22TSS014 với thiết kế tay ngắn, cổ tròn kết hợp có phía trước ngực, form ôm vừa vặn vào body và chất liệu 100% cotton thoáng mát và thấm hút mồ hôi tốt. Điểm đặc biệt sản phẩm là phần họa tiết chữ trước ngực được in rất tỉ mỉ và sắc giúp chiếc áo trở nên ấn tượng, trẻ trung và hiện đại hơn.",
            "status": true,
            "qty": 1
          }
        }
      ],
      "userId": 1,
      "mdh": "a7d64da4-c6af-4808-a8af-b6177a0a243e",
      "timeOrder": "2/16/2023, 7:04:11 PM",
      "quantityOrder": 2,
      "total": 50,
      "id": 1
    }
  ]
}